tutorials/multiphase/waves/waveSolver/standingWave/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  0 -0.4 0 )
    ( 11.085 -0.4 0 )
    (  0  0.2 0 )
    ( 11.085  0.2 0 )
                 
    (  0 -0.4 0.1 )
    ( 11.085 -0.4 0.1 )
    (  0  0.2 0.1 )
    ( 11.085  0.2 0.1 )                    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 357 60 1 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    wall bottom 
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (2 3 7 6)
    )
    
    empty frontBack
    (
        (0 1 3 2)
        (4 5 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
